In [1]:
import pandas as pd
data = pd.read_csv("stores.csv")
data.head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2013-152156,11/9/2013,11/12/2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [2]:
data['Segment'].unique()

array(['Consumer', 'Corporate', 'Home Office'], dtype=object)

In [4]:
data[data['Segment']=='Consumer']['Sales'].mean()

223.73364380658828

In [5]:
data[data['Segment']=='Corporate']['Sales'].mean()

233.82330026490064

In [6]:
data[data['Segment']=='Home Office']['Sales'].mean()

240.97204066180595

In [7]:
data.groupby("Segment").agg({'Sales':'mean'})

                  Sales
Segment
Consumer     223.733644
Corporate    233.823300
Home Office  240.972041

In [8]:
data.groupby("Segment")['Sales'].mean()

Segment
Consumer       223.733644
Corporate      233.823300
Home Office    240.972041
Name: Sales, dtype: float64

In [9]:
data.groupby(['Segment','Ship Mode']).agg({'Sales':'mean','Discount':'max'})

                                 Sales  Discount
Segment     Ship Mode
Consumer    First Class     206.981749       0.8
            Same Day        191.155707       0.8
            Second Class    226.959755       0.8
            Standard Class  230.190299       0.8
Corporate   First Class     218.264886       0.8
            Same Day        395.801079       0.8
            Second Class    239.944234       0.8
            Standard Class  225.739810       0.8
Home Office First Class     304.228831       0.8
            Same Day        202.191455       0.8
            Second Class    258.128421       0.8
            Standard Class  223.191537       0.8